In [125]:
import pandas as pd

## Data Frame

In [105]:
forum_users = {
    "User ID": [1,2,3,4,5],
    "Username": ['bogdan', 'vova', 'Lena', 'dima', 'andrey'],
    "Age": [18 ,35, 25, 38, None],
    "Joined Date": pd.to_datetime(['2032-01-01', '2022-08-01', '2035-11-21', '2027-12-01', '2002-05-10']),
    "Total Posts": [150, 320, 80, 420, 310],
    "Reputation": [500, 720, 200, 940, 500]
}
df = pd.DataFrame(forum_users)
df

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   bogdan  18.0  2032-01-01          150         500
1        2     vova  35.0  2022-08-01          320         720
2        3     Lena  25.0  2035-11-21           80         200
3        4     dima  38.0  2027-12-01          420         940
4        5   andrey   NaN  2002-05-10          310         500

In [106]:
df.shape

(5, 6)

In [107]:
type(df)

pandas.core.frame.DataFrame

In [108]:
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [109]:
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [110]:
type(df.columns)

pandas.core.indexes.base.Index

In [111]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [112]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [113]:
df.dtypes

User ID                 int64
Username               object
Age                   float64
Joined Date    datetime64[ns]
Total Posts             int64
Reputation              int64
dtype: object

In [114]:
df.values

array([[1, 'bogdan', 18.0, Timestamp('2032-01-01 00:00:00'), 150, 500],
       [2, 'vova', 35.0, Timestamp('2022-08-01 00:00:00'), 320, 720],
       [3, 'Lena', 25.0, Timestamp('2035-11-21 00:00:00'), 80, 200],
       [4, 'dima', 38.0, Timestamp('2027-12-01 00:00:00'), 420, 940],
       [5, 'andrey', nan, Timestamp('2002-05-10 00:00:00'), 310, 500]],
      dtype=object)

In [115]:
type(df.values)

numpy.ndarray

In [116]:
df.values[1, 1]

'vova'

In [117]:
df.head(3)

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   bogdan  18.0  2032-01-01          150         500
1        2     vova  35.0  2022-08-01          320         720
2        3     Lena  25.0  2035-11-21           80         200

In [118]:
df.tail(3)

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3     Lena  25.0  2035-11-21           80         200
3        4     dima  38.0  2027-12-01          420         940
4        5   andrey   NaN  2002-05-10          310         500

In [119]:
df.describe().round(2)

       User ID    Age          Joined Date  Total Posts  Reputation
count     5.00   4.00                    5         5.00        5.00
mean      3.00  29.00  2024-02-24 00:00:00       256.00      572.00
min       1.00  18.00  2002-05-10 00:00:00        80.00      200.00
25%       2.00  23.25  2022-08-01 00:00:00       150.00      500.00
50%       3.00  30.00  2027-12-01 00:00:00       310.00      500.00
75%       4.00  35.75  2032-01-01 00:00:00       320.00      720.00
max       5.00  38.00  2035-11-21 00:00:00       420.00      940.00
std       1.58   9.20                  NaN       137.95      276.62

In [120]:
df.select_dtypes(include="object")

  Username
0   bogdan
1     vova
2     Lena
3     dima
4   andrey

In [121]:
df.select_dtypes(include="int64")

   User ID  Total Posts  Reputation
0        1          150         500
1        2          320         720
2        3           80         200
3        4          420         940
4        5          310         500

In [122]:
df.select_dtypes(include="object").columns

Index(['Username'], dtype='object')

In [123]:
df.isna()

   User ID  Username    Age  Joined Date  Total Posts  Reputation
0    False     False  False        False        False       False
1    False     False  False        False        False       False
2    False     False  False        False        False       False
3    False     False  False        False        False       False
4    False     False   True        False        False       False

In [124]:
df.isna().sum()

User ID        0
Username       0
Age            1
Joined Date    0
Total Posts    0
Reputation     0
dtype: int64

## Series

In [134]:
username_series = df["Username"]
username_series

0    bogdan
1      vova
2      Lena
3      dima
4    andrey
Name: Username, dtype: object

In [131]:
type(username_series)

pandas.core.series.Series

In [136]:
username_series.values

array(['bogdan', 'vova', 'Lena', 'dima', 'andrey'], dtype=object)

In [137]:
username_series.index

RangeIndex(start=0, stop=5, step=1)

In [143]:
reputation_series = df["Reputation"].value_counts(ascending=True)
reputation_series

Reputation
720    1
200    1
940    1
500    2
Name: count, dtype: int64

In [139]:
reputation_series = df["Reputation"].value_counts()
reputation_series

Reputation
500    2
720    1
200    1
940    1
Name: count, dtype: int64

In [139]:
reputation_series = df["Reputation"].value_counts()
reputation_series

Reputation
500    2
720    1
200    1
940    1
Name: count, dtype: int64

In [140]:
df["Reputation"].unique()

array([500, 720, 200, 940])

In [144]:
df['Username'].sort_values(ascending=False)

1      vova
3      dima
0    bogdan
4    andrey
2      Lena
Name: Username, dtype: object